; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-63)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 - object)
 (:init 
    (arm-empty)
    (clear b14)
    (on b14 b4)
    (on b4 b9)
    (on b9 b2)
    (on b2 b1)
    (on b1 b19)
    (on b19 b18)
    (on b18 b12)
    (on-table b12)
    (clear b15)
    (on b15 b5)
    (on-table b5)
    (clear b17)
    (on b17 b8)
    (on b8 b13)
    (on b13 b6)
    (on b6 b11)
    (on b11 b10)
    (on b10 b16)
    (on b16 b3)
    (on b3 b7)
    (on-table b7))
 (:goal (and 
(on b8 b3)
))
)

; plan
1. (unstack b17 b8)
   deleted: (on b17 b8) (clear b17) (arm-empty)
   added: (holding b17) (clear b8)
   goals met: 0 of 1
2. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 1
3. (unstack b8 b13)
   deleted: (on b8 b13) (clear b8) (arm-empty)
   added: (holding b8) (clear b13)
   goals met: 0 of 1
4. (stack b8 b14)
   deleted: (clear b14) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b14)
   goals met: 0 of 1
5. (unstack b13 b6)
   deleted: (on b13 b6) (clear b13) (arm-empty)
   added: (holding b13) (clear b6)
   goals met: 0 of 1
6. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 1
7. (unstack b6 b11)
   deleted: (on b6 b11) (clear b6) (arm-empty)
   added: (holding b6) (clear b11)
   goals met: 0 of 1
8. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 1
9. (unstack b11 b10)
   deleted: (on b11 b10) (clear b11) (arm-empty)
   added: (holding b11) (clear b10)
   goals met: 0 of 1
10. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 1
11. (unstack b10 b16)
   deleted: (on b10 b16) (clear b10) (arm-empty)
   added: (holding b10) (clear b16)
   goals met: 0 of 1
12. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 1
13. (unstack b16 b3)
   deleted: (on b16 b3) (clear b16) (arm-empty)
   added: (holding b16) (clear b3)
   goals met: 0 of 1
14. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 1
15. (unstack b8 b14)
   deleted: (on b8 b14) (clear b8) (arm-empty)
   added: (holding b8) (clear b14)
   goals met: 0 of 1
16. (stack b8 b3)
   deleted: (clear b3) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b3)
   goals met: 1 of 1
